; domain
(define (domain liftedtcore_blocksworld-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :action-costs)
 (:types block)
 (:constants
   purple_block_1 green_block_1 - block
 )
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block) (hold_0))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (when (and (not (and (ontable purple_block_1) (not (= ?obj purple_block_1)))) (or (= ?obj green_block_1) (holding green_block_1))) (hold_0)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (when (and (not (or (= ?obj purple_block_1) (ontable purple_block_1))) (holding green_block_1) (not (= ?obj green_block_1))) (hold_0)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (when (and (not (ontable purple_block_1)) (holding green_block_1) (not (= ?obj green_block_1))) (hold_0)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (when (and (not (ontable purple_block_1)) (or (= ?obj green_block_1) (holding green_block_1))) (hold_0)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_blocksworld-problem)
 (:domain liftedtcore_blocksworld-domain)
 (:objects
   black_block_1 black_block_2 green_block_2 - block
 )
 (:init (ontable green_block_1) (on black_block_1 green_block_1) (ontable black_block_2) (on green_block_2 black_block_2) (ontable purple_block_1) (clear black_block_1) (clear green_block_2) (clear purple_block_1) (handempty) (= (total-cost) 0))
 (:goal (and (ontable black_block_1) (hold_0)))
 (:metric minimize (total-cost))
)

; plan
1. (pickup purple_block_1)
   deleted: (clear purple_block_1) (ontable purple_block_1) (handempty)
   added: (holding purple_block_1)
   goals met: 0 of 2
2. (stack purple_block_1 green_block_2)
   deleted: (clear green_block_2) (holding purple_block_1)
   added: (handempty) (clear purple_block_1) (on purple_block_1 green_block_2)
   goals met: 0 of 2
3. (unstack black_block_1 green_block_1)
   deleted: (on black_block_1 green_block_1) (clear black_block_1) (handempty)
   added: (holding black_block_1) (clear green_block_1)
   goals met: 0 of 2
4. (putdown black_block_1)
   deleted: (holding black_block_1)
   added: (clear black_block_1) (handempty) (ontable black_block_1)
   goals met: 1 of 2
5. (pickup green_block_1)
   deleted: (clear green_block_1) (ontable green_block_1) (handempty)
   added: (holding green_block_1) (hold_0)
   goals met: 2 of 2
